#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Thu Nov 14 21:21:43 2024

add_simulation "F:/SME_files/SME309/codes/SME209_codes/lab3/PDS_lab3_MyCycle/Hardware/Simulation_Source/tb_MCycle.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
add_design "F:/SME_files/SME309/codes/SME209_codes/lab3/PDS_lab3_MyCycle/Hardware/Design_Source/ALU.v"
add_design "F:/SME_files/SME309/codes/SME209_codes/lab3/PDS_lab3_MyCycle/Hardware/Design_Source/ARM.v"
add_design "F:/SME_files/SME309/codes/SME209_codes/lab3/PDS_lab3_MyCycle/Hardware/Design_Source/CondLogic.v"
add_design "F:/SME_files/SME309/codes/SME209_codes/lab3/PDS_lab3_MyCycle/Hardware/Design_Source/ControlUnit.v"
add_design "F:/SME_files/SME309/codes/SME209_codes/lab3/PDS_lab3_MyCycle/Hardware/Design_Source/Decoder.v"
add_design "F:/SME_files/SME309/codes/SME209_codes/lab3/PDS_lab3_MyCycle/Hardware/Design_Source/Extend.v"
add_design "F:/SME_files/SME309/codes/SME209_codes/lab3/PDS_lab3_MyCycle/Hardware/Design_Source/ProgramCounter.v"
add_design "F:/SME_files/SME309/codes/SME209_codes/lab3/PDS_lab3_MyCycle/Hardware/Design_Source/RegisterFile.v"
add_design "F:/SME_files/SME309/codes/SME209_codes/lab3/PDS_lab3_MyCycle/Hardware/Design_Source/Shifter.v"
add_design "F:/SME_files/SME309/codes/SME209_codes/lab3/PDS_lab3_MyCycle/Hardware/Design_Source/TOP_Pango.v"
add_design "F:/SME_files/SME309/codes/SME209_codes/lab3/PDS_lab3_MyCycle/Hardware/Design_Source/Wrapper.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module MCycle
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "F:/SME_files/SME309/codes/SME209_codes/lab2/PDS_Lab2_Template/Hardware/Constraint_Source/Top.fdc"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
