#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Thu Oct 17 19:18:00 2024

add_simulation "F:/SME_files/SME309/codes/SME209_codes/lab2/PDS_Lab2_Template/Hardware/Simulation_Source/Wrapper_tb.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package MBG324
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
